import styled from "styled-components";
import { useParams } from "react-router-dom";
import Faq from "./ContentComponents/Faq";
import Translate from "../Translate";

export default function Content() {
  const { page } = useParams<{ page?: string }>();
  const content: { [key: string]: JSX.Element } = {
    faq: <Faq></Faq>,
    privacy: (
      <Div>
        <h1>wesebi da pirobebi</h1>
        <Translate
          str="
          წინამდებაწინამდებარე წესები და პირობები წარმოადგენს თქვენსა და “მარმენიოს” შორის დადებულ სავალდებულო ძალის მქონე შეთანხმებას და არეგულირებს თქვენ მიერ მარმენიო-ს ვებ-გვერდის გამოყენებას.

          ⁃ მარმენიო არის ონლაინ მაღაზია, რომელიც მის მართველობაში მქონე ვებ-გვერდის მეშვეობით კლიენტს სთავაზობს სხვადასხვა სახის პროდუქციას.
          ⁃ კლიენტი დაინტერესებულია ონლაინ, სახლიდან გაუსვლელად, შეიძინოს ვებ-გვერდზე განთავსებული პროდუქცია. 
          
          ნივთის დაბრუნების პროცესთან და მის წესებთან დაკავშირებით დეტალური ინფორმაციის მისაღებად გაეცანით ნივთის გარანტია, გადაცვლა, დაბრუნების პოლიტიკას.
          პერსონალურ მონაცემთა დამუშავებისა და კონფიდენციალურობის პოლიტიკის და ნივთის დაბრუნების პოლიტიკის მარეგულირებელი დოკუმენტები ამ წესებისა და მხარეთა შორის გარიგების განუყოფელი ნაწილია და მინიჭებული აქვს იდენტური სამართლებრივი სტატუსი.
          
          მომხმარებლის მიერ საიტზე შესვლა (ავტორიზაცია/რეგისტრაცია) და საიტიდან ინფორმაციის მიღება ან მომსახურების გამოყენება გულისხმობს იმას, რომ მომხმარებელი თანახმაა დაიცვას წინამდებარე მოხმარების წესებით დადგენილი პირობები და ასევე კონკრეტული პროდუქციის შესაბამის აღწერაში მითითებული წესები.
          
          ⁃ საიტით მომსახურება განკუთვნილია მხოლოდ იმ მომხმარებლებისთვის, რომელთაც რომელიმე მოქმედი იურისდიქციის კანონმდებლობით არ ეკრძალებათ ან ეზღუდებათ მომსახურების მიღება ინტერნეტით.
          ⁃ საიტის მოხმარებით მომხმარებლები თანხმობას იძლევიან, რომ მათ მიერ მომსახურების გამოყენება შესაბამისობაშია ყველა მოქმედი კანონმდებლობის, რეგულაციის და დებულების, მათ შორის საგადასახადო, წესებთან. 
          ⁃ კომპანია პასუხს არ აგებს მომხმარებლის მიერ მომსახურების უკანონო ან არაავტორიზებულ გამოყენებაზე.
          ⁃ მომხმარებელი პასუხისმგებელია გადაამოწმოს მისი იურისდიქციის შესაბამისი კანონმდებლობა საიტზე დარეგისტრირებამდე და მომსახურების მიღებამდე.
          
          
          შეკვეთის განხორციელება

          ⁃ მომხმარებელს ნივთის შეძენა შეუძლია დეპოზოტის განთავსებით. 
          ⁃ ნივთის შესაძენად კლიენტი მარმენიოს საბანკო ანგარიშზე ანთავსებს თანხას დეპოზიტის სახით.
          ⁃ გარკვეული ნივთები ჩამოდის შეკვეთით, 15-20 სამუშაო დღეში, ნივთების უმეტესობა კი ადგილზეა. ნივთის შესაძენად, რომელიც ადგიზლეა, აუცილებელია სრული თანხის გადახდა.
          ⁃ ხოლო ნივთის შესაკვეთად, რომელიც ადგიზლე არ არის, აუცილებელია დეპოზიტის განთავსება მარმენიოს ანგარიშზე.
          ⁃ შეკვეთის განხორციელებიდან 20 სამუშაო დღემდე, მომხმარებელი თუ გააქუმებს შეკვეთას, მას დეპოზიტი უკან არ დაუბრუნდება, 20 სამუშაო დღის შემდეგ თუ არ ჩამოვა ნივთი, შეუძლია მოითხოვოს შეკვეთის გაუქმება და დეპოზიტის უკან დაბრუნება.
          
          
          
          მარმენიოს ვალდებულებები 

          ⁃  მარმენიო, საბანკო ანგარიშზე კლიენტის მიერ გადახდილი თანხის განთავსების მომენტიდან არაუმეტეს 2 სამუშაო დღის განმავლობაში ვალდებულია უზრუნველყოს კლიენტის შეკვეთის დამუშავება. ნივთის კლიენტისთვის მიწოდების ვადა არ უნდა აღემატებოდეს შეკვეთის დამუშავებიდან 6 სამუშაო დღეს. 
          ⁃  მომსახურება დასრულებულად ითვლება ნივთის კლიენტისთვის ჩაბარებისთანავე.
          ⁃  კლიენტისთვის ნივთის მიწოდების შეუძლებლობის შემთხვევაში შეკვეთა გაუქმდება და კლიენტს დაუბრუნდება მის მიერ გადახდილი თანხა.
          ⁃  ნივთი, რომელიც არ არის ადგილზე და მომხმარებლის მიერ დეპოზიტის განთავსების შემდეგ 17-23 სამუშაო დრეში არ მიიღებს კლიენტი, მარმენიო ავლდებულია დეპოზიტის სახით ჩარიცხული თანხა დაუბრუნოს კლინეტს და გააუქმოს შეკვეთა.
          
          
          პირადი მონაცემები

          ⁃ მარმენიოს საიტის ბაზაში ან მომხმარებელთან პირდაპირი სატელეფონო კომუნიკაციის დროს ინახავს თქვენს მონაცემებს. კერძოდ, სახელი და გვარი და საკონტაქტო ტელეფონის ნომერი. 
          ⁃ ეს მონაცემები ინახება დაცულ სერვერზე და ამ მხრივ მომხმარებელს შეუძლია თავი სრულიად უსაფრთხოდ იგრძნოს.
          ⁃ არცერთი მესამე მხარისთვის რომელიმე ამ ინფორმაციის გადაცემა არ ხდება არანაირი მიზნით, გარდა საქართველოს კანონმდებლობით გათვალისწინებული შემთხვევებისა.
          
          
          წესებისა და პირობების შეცვლის შემთხვევაში, მარმენიო ვალდებულია ამის შესახებ აცნობოს დარეგისტრირებულ მომხმარებელს, გონივრული ვადით ადრე.
           "
        />
      </Div>
    ),
    shipping: (
      <Div>
        <h1>miwodebis pirobebi</h1>

        <Translate
          str={`
          როგორ ხდება ნივთის მიწოდება?
          
          ⁃ ჩვენი პარტნიორი საკურიერო კომპანია მოგაწვდით თქვენთვის სასურველ ნივთს, საქართველოს ნებისმიერ წერტილში, ნებისმიერ მისამართზე. (დროებით ოკუპირებული ტერიტორიების გარდა). 

          რა ვადაში მომაწვდით შეძენილ ნივთს?
        
          ⁃ თბილისი: შეკვეთის დაფიქსირებიდან 1-3 სამუშაო დღის ვადაში. 
          ⁃ რეგიონები: შეკვეთის დაფიქსირებიდან 2-7 სამუშაო დღის ვადაში. 
          
         <strong> რა ვადაში მივიღებ გამოწერილ ნითს, რომელიც მარაგში არ გაქვთ? </strong>

         ⁃ ნივთი რომელიც არ არის მაგარში, ჩამოგვაქვს შეკვეთით. 15-20 სამუშაო დღე არის საჭირო ნივთის თბილისში მისაღებად.

          მნიშვნელოვანია გაითვალისწინოთ, რომ სართულზე ატანის სერვისი არ არის გათვალისწინებული. გამონაკლისები დაიშვება მხოლოდ ან საიტზე მითითებულ შემთხვევაში, ან მცირე გაბარიტიანი, 5 კგ-მდე წონის ნივთების მიტანისას და ასევე, დიდი მოცულობის ნივთებზე უშუალოდ კურიერთან, ადგილზე, მომხმარებელსა და მას შორის პირადი მოლაპარაკების შემთხვევაში.
          
          ნივთის დაბრუნების, შეცვლის პირობები: 

          ⁃ ზოგადი ინსტუქცია: დადგენილი ვიზუალური დეფექტის გამო, ნივთის დაბრუნება ხდება, მისი შეძენიდან 5 კალენდარული დღის განმავლობაში;
          
          დაბრუნების პროცესის წამოსაწყებად, საჭიროა მარმენიო-ს ცხელ ხაზზე აცნობოთ დასაბრუნებელი პროდუქტის მაიდენტიფიცირებელი მონაცემები: 
          
          ⁃ შეკვეთის ნომერი, შეკვეთის მისამართზე მიღების თარიღი; 
          ⁃ ტრანზაქციის (გადახდის) დამადასტურებელი ინფორმაცია; 
          
          თუ ნივთს გახსნისთანავე (ყუთიდან ამოღებისთანავე) აქვს ვიზუალური დეფექტი:
          
          ⁃ გადაიღეთ ვიზუალური დეფექტის ფოტოსურათები; <br />
          ⁃ ნივთის ყიდვიდან 3 კალენდარული დღის განმავლობაში, დაუკავშირდით მარმენიო- ს და მიაწოდეთ ფოტო მასალა, შეკვეთის მაიდენტიფიცირებელი მონაცემები და ხარვეზის დეტალური აღწერილობა; <br />
          ⁃ ბრუნდება მხოლოდ ის ნივთი, რომელზეც დადასტურდება ქარხნული დეფექტი, შეიცვლება მარმენიოს მიერ დადგენილი წესით.
          ⁃ ნივთის შეცვლა დაშვებულია მხოლოდ სრული კომპლექტაციით, აუცილებელია ყუთის და ყველა აქსესუარის შენახვა; 
          
          ნივთის დაბრუნების / შეცვლის პროცესის წამოწყება ასევე შესაძლებელია, თუ:
          
          ⁃ მომხმარებელთან მიტანილი ნივთი არ შეესაბამება შეკვეთაში არსებული ნივთის მახასიათებლებს;
          ⁃ ნივთი დაზიანდა მიტანის პროცესში (გარეგანი დაზიანებები);
          `}
        />
      </Div>
    ),
    paymentmethods: (
      <Div>
        <h1>gadaxdis pirobebi</h1>
        <p>
          saitze angariSsworebisTvis SegiZliaT gamoiyenoT sabanko gadaricxvis
          meTodi.
          <br />
          aucilebelia Tanxis gadaricxvisas daniSnulebaSi miuTiToT nivTis
          dasaxeleba, Tqveni saxeli/gvari da sakontaqto nomeri.
        </p>
      </Div>
    ),
  };
  return (
    <Div>
      <P>marmenio</P>
      {content[page ?? ""] || <p>Page not found</p>}
    </Div>
  );
}
const Div = styled.div`
  font-family: "nusx";
  display: flex;
  justify-content: center;
  flex-direction: column;
  align-items: center;
  padding: 1% 5%;
  text-align: start;
  gap: 2rem;
  color: black;
  line-height: 1rem;
  font-size: 1rem;
  font-weight: 200;
  line-height: 1.6rem;
  h1 {
    font-family: "bolnisi";
    font-size: 1.4rem;
  }
  @media (min-width: 775px) {
    h1 {
      font-size: 1.8rem;
    }
    line-height: 1.9rem;
    font-size: 1.2rem;
  }
`;
const P = styled.p`
  font-family: "tsripa";
  color: #945d09;
  @media (min-width: 775px) {
    font-size: 1.7rem;
  }
`;
